Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetMaterialMarketSizes Method
 Returns an enumerator of all material marketsizes. Data is read from XS_PROFDB\marketsizes.dat file.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MaterialMarketSizesItemEnumerator GetMaterialMarketSizes()
Public Function GetMaterialMarketSizes As MaterialMarketSizesItemEnumerator
Return Value
Type: MaterialMarketSizesItemEnumerator
A MaterialMarketSizesItemEnumerator of all material marketsizes.
Exceptions
Exception | Condition
CatalogItemEnumeratorInitializationException | Thrown when initialization of MaterialMarketSizesItemEnumerator fails.
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace